Revit 2027 API
View.DisableTemporaryViewMode Method
 Disables the specified temporary view mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
Public Sub DisableTemporaryViewMode (
	mode As TemporaryViewMode
)
public:
void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
member DisableTemporaryViewMode :
        mode : TemporaryViewMode -> unit
Parameters
mode TemporaryViewMode
 The mode to disable.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  View cannot use temporary visibility modes.
Remarks
 Has no effect if the mode is already disabled.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace